#Вывести на экран числа от -N до N

N = int(input('введите число '))
for i in range (-N,N+1):
    print (i, end = ' ')